  main.cpp
  
  class Circle	size(20):
  	+---
   0	| +--- (base class Figure)
   0	| | {vfptr}
   4	| | _id
  	| +---
   8	| _x
  12	| _y
  16	| _r
  	+---
  
  Circle::$vftable@:
  	| &Circle_meta
  	|  0
   0	| &Figure::draw 
  正在生成代码...
  正在编译...
  shape.cpp
  
  class Circle	size(20):
  	+---
   0	| +--- (base class Figure)
   0	| | {vfptr}
   4	| | _id
  	| +---
   8	| _x
  12	| _y
  16	| _r
  	+---
  
  Circle::$vftable@:
  	| &Circle_meta
  	|  0
   0	| &Figure::draw 
  正在生成代码...
  shape2.0.vcxproj -> H:\c++\c++_primer\for_test\test15\draw\shape2.0\Debug\shape2.0.exe
  shape2.0.vcxproj -> H:\c++\c++_primer\for_test\test15\draw\shape2.0\Debug\shape2.0.pdb (Full PDB)
